# coding = utf-8
'''
Created on 2016年10月29日
@author: 陈应龙
'''

#操作符优先级问题，幂运算（**）>正负号(+,-)>算术操作符(+,-,*,/,//)>比较操作符(<,<=,>,>=,==,!=)>逻辑操作符(not,and,or)
# 关于 + ，- ，* ，/ ，** ，// ，%操作符说明

a = b = c = d = 6 #把6赋值给前面的四个变量

a += 3 # a = a+3简写，结果为6+3=9
print(a)

b -= 2 # b = b-2简写，结果为6-2=4
print(b)

c *= 5 # c = c*5简写，结果为6*5=30
print(c)

d /= 4 # d = d/4简写，6/4=1.5
print(d) 

e = a**b # 指数乘法，9**4=6561
print(e)

f = c//7 # 地板除法，30//7=4，只取除数的整数部分
print(f)

g = c%7 # 求余数，30%7=2，被除数剩下的余数
print(g)

h = -3*2+5/-2-4 # (((-3)*2)+(5/(-2)))-4,加减乘除优先级加上括号更容易看清楚
print(h)

